
/* Presented when user typed illegal characters -- No valid object */
"Invalid number" = "מספר שאינו תקין";

/* Presented when user value smaller than minimum */
"Fell short of minimum" = "לא הגיע למינימום";

/* Presented when user value larger than maximum */
"Maximum exceeded" = "מעבר למותר";

/* Presented when value is a float, but floats not allowed */
"Floating Point not allowed" = "מספרים שלמים בלבד";

/* Presented when string cannot be converted to an NSDate */
"Invalid date string" = "מחרוזת תאריך שאינה תקינה";

